"{\"class_name\": \"Tokenizer\", \"config\": {\"num_words\": null, \"filters\": \"!\\\"#$%&()*+,-./:;<=>?@[\\\\]^_`{|}~\\t\\n\", \"lower\": true, \"split\": \" \", \"char_level\": false, \"oov_token\": null, \"document_count\": 396, \"word_counts\": \"{\\\"identifier\\\": 181066, \\\"punctuation\\\": 273727, \\\"operator\\\": 83226, \\\"keyword\\\": 46167, \\\"public\\\": 4730, \\\"class\\\": 1758, \\\"static\\\": 5922, \\\"data\\\": 29857, \\\"type\\\": 29857, \\\"void\\\": 2192, \\\"throws\\\": 965, \\\"new\\\": 7740, \\\"long\\\": 5722, \\\"number\\\": 23268, \\\"for\\\": 5393, \\\"int\\\": 19789, \\\"string\\\": 1927, \\\"implements\\\": 217, \\\"this\\\": 1076, \\\"return\\\": 6976, \\\"boolean\\\": 2139, \\\"if\\\": 5007, \\\"false\\\": 647, \\\"continue\\\": 169, \\\"true\\\": 684, \\\"else\\\": 1563, \\\"private\\\": 870, \\\"byte\\\": 241, \\\"while\\\": 1641, \\\"system\\\": 4730, \\\"call\\\": 2365, \\\"in\\\": 817, \\\"out\\\": 1469, \\\"throw\\\": 148, \\\"string2\\\": 389, \\\"null\\\": 946, \\\"interface\\\": 19, \\\"println\\\": 844, \\\"import\\\": 3486, \\\"java\\\": 1732, \\\"io\\\": 895, \\\"bufferedreader\\\": 161, \\\"ioexception\\\": 224, \\\"inputstream\\\": 76, \\\"inputstreamreader\\\": 167, \\\"printwriter\\\": 111, \\\"util\\\": 726, \\\"stringtokenizer\\\": 91, \\\"final\\\": 223, \\\"try\\\": 706, \\\"catch\\\": 698, \\\"double\\\": 476, \\\"print\\\": 290, \\\"math\\\": 67, \\\"biginteger\\\": 47, \\\"break\\\": 255, \\\"bigdecimal\\\": 9, \\\"roundingmode\\\": 6, \\\"char\\\": 624, \\\"text\\\": 19, \\\"decimalformat\\\": 10, \\\"scanner\\\": 62, \\\"fileinputstream\\\": 16, \\\"do\\\": 20, \\\"with\\\": 1, \\\"case\\\": 12, \\\"outputstream\\\": 37, \\\"arraylist\\\": 81, \\\"arrays\\\": 79, \\\"bufferedwriter\\\": 15, \\\"outputstreamwriter\\\": 20, \\\"printstream\\\": 7, \\\"extends\\\": 6, \\\"super\\\": 5, \\\"map\\\": 24, \\\"entry\\\": 8, \\\"treeset\\\": 18, \\\"stack\\\": 21, \\\"vector\\\": 9, \\\"inputmismatchexception\\\": 25, \\\"javax\\\": 11, \\\"swing\\\": 6, \\\"plaf\\\": 3, \\\"iconuiresource\\\": 3, \\\"lang\\\": 12, \\\"reflect\\\": 9, \\\"array\\\": 14, \\\"collationelementiterator\\\": 3, \\\"getproperty\\\": 15, \\\"html\\\": 3, \\\"parser\\\": 2, \\\"entity\\\": 2, \\\"collections\\\": 51, \\\"lineseparator\\\": 1, \\\"sql\\\": 5, \\\"collection\\\": 3, \\\"comparator\\\": 23, \\\"deque\\\": 3, \\\"hashmap\\\": 33, \\\"hashset\\\": 23, \\\"linkedlist\\\": 23, \\\"priorityqueue\\\": 25, \\\"queue\\\": 14, \\\"set\\\": 9, \\\"treemap\\\": 16, \\\"objects\\\": 5, \\\"random\\\": 7, \\\"regex\\\": 1, \\\"pattern\\\": 1, \\\"list\\\": 21, \\\"bufferedoutputstream\\\": 3, \\\"filenotfoundexception\\\": 16, \\\"filereader\\\": 6, \\\"linkedhashset\\\": 3, \\\"instanceof\\\": 28, \\\"function\\\": 15, \\\"bifunction\\\": 3, \\\"inttolongfunction\\\": 3, \\\"awt\\\": 6, \\\"container\\\": 4, \\\"file\\\": 20, \\\"filewriter\\\": 4, \\\"err\\\": 23, \\\"switch\\\": 1, \\\"default\\\": 1, \\\"stream\\\": 18, \\\"collectors\\\": 11, \\\"nio\\\": 4, \\\"charset\\\": 1, \\\"standardcharsets\\\": 1, \\\"arraydeque\\\": 3, \\\"setin\\\": 7, \\\"setout\\\": 9, \\\"protected\\\": 17, \\\"float\\\": 5, \\\"fileoutputstream\\\": 2, \\\"bitset\\\": 3, \\\"calendar\\\": 2, \\\"sortedset\\\": 3, \\\"currenttimemillis\\\": 15, \\\"gc\\\": 2, \\\"datainputstream\\\": 11, \\\"stringjoiner\\\": 5, \\\"intstream\\\": 4, \\\"flush\\\": 7, \\\"parseexception\\\": 1, \\\"simpledateformat\\\": 2, \\\"consumer\\\": 2, \\\"seterr\\\": 2, \\\"htmldocument\\\": 1, \\\"htmlreader\\\": 1, \\\"preaction\\\": 1, \\\"management\\\": 3, \\\"query\\\": 3, \\\"concurrent\\\": 5, \\\"threadlocalrandom\\\": 3, \\\"longstream\\\": 1, \\\"jar\\\": 1, \\\"jarentry\\\": 1, \\\"exit\\\": 1, \\\"bytearrayinputstream\\\": 1, \\\"printf\\\": 1, \\\"timeunit\\\": 2, \\\"hashtable\\\": 1, \\\"iterator\\\": 2, \\\"binaryoperator\\\": 1, \\\"arraycopy\\\": 1, \\\"mathcontext\\\": 2, \\\"docflavor\\\": 2, \\\"writer\\\": 1, \\\"paths\\\": 3, \\\"read\\\": 3, \\\"time\\\": 4, \\\"instant\\\": 1, \\\"localdate\\\": 1, \\\"localdatetime\\\": 1, \\\"localtime\\\": 1, \\\"linkedhashmap\\\": 2, \\\"point\\\": 2}\", \"word_docs\": \"{\\\"in\\\": 393, \\\"void\\\": 395, \\\"type\\\": 396, \\\"else\\\": 318, \\\"public\\\": 396, \\\"string\\\": 344, \\\"interface\\\": 16, \\\"system\\\": 396, \\\"int\\\": 396, \\\"private\\\": 140, \\\"static\\\": 396, \\\"new\\\": 396, \\\"for\\\": 396, \\\"if\\\": 375, \\\"continue\\\": 71, \\\"null\\\": 240, \\\"keyword\\\": 396, \\\"call\\\": 396, \\\"punctuation\\\": 396, \\\"throws\\\": 269, \\\"long\\\": 329, \\\"identifier\\\": 396, \\\"return\\\": 355, \\\"class\\\": 396, \\\"boolean\\\": 222, \\\"true\\\": 191, \\\"string2\\\": 196, \\\"while\\\": 370, \\\"operator\\\": 396, \\\"false\\\": 182, \\\"number\\\": 396, \\\"throw\\\": 72, \\\"implements\\\": 127, \\\"data\\\": 396, \\\"this\\\": 177, \\\"byte\\\": 69, \\\"out\\\": 396, \\\"println\\\": 326, \\\"stringtokenizer\\\": 77, \\\"java\\\": 220, \\\"try\\\": 265, \\\"bufferedreader\\\": 129, \\\"printwriter\\\": 88, \\\"print\\\": 128, \\\"util\\\": 149, \\\"ioexception\\\": 149, \\\"import\\\": 220, \\\"io\\\": 160, \\\"final\\\": 106, \\\"inputstream\\\": 47, \\\"catch\\\": 263, \\\"double\\\": 237, \\\"inputstreamreader\\\": 130, \\\"biginteger\\\": 41, \\\"math\\\": 47, \\\"break\\\": 118, \\\"bigdecimal\\\": 9, \\\"roundingmode\\\": 6, \\\"char\\\": 142, \\\"text\\\": 17, \\\"decimalformat\\\": 10, \\\"do\\\": 11, \\\"scanner\\\": 51, \\\"fileinputstream\\\": 12, \\\"with\\\": 1, \\\"case\\\": 2, \\\"outputstream\\\": 31, \\\"arraylist\\\": 69, \\\"arrays\\\": 66, \\\"outputstreamwriter\\\": 16, \\\"bufferedwriter\\\": 13, \\\"printstream\\\": 7, \\\"super\\\": 3, \\\"extends\\\": 4, \\\"entry\\\": 8, \\\"map\\\": 22, \\\"treeset\\\": 16, \\\"vector\\\": 9, \\\"inputmismatchexception\\\": 22, \\\"stack\\\": 19, \\\"iconuiresource\\\": 3, \\\"javax\\\": 10, \\\"plaf\\\": 3, \\\"lang\\\": 12, \\\"array\\\": 14, \\\"swing\\\": 6, \\\"reflect\\\": 9, \\\"collationelementiterator\\\": 3, \\\"getproperty\\\": 9, \\\"parser\\\": 2, \\\"html\\\": 3, \\\"entity\\\": 2, \\\"collections\\\": 44, \\\"lineseparator\\\": 1, \\\"queue\\\": 13, \\\"collection\\\": 3, \\\"linkedlist\\\": 22, \\\"comparator\\\": 22, \\\"treemap\\\": 15, \\\"priorityqueue\\\": 22, \\\"sql\\\": 5, \\\"deque\\\": 3, \\\"hashmap\\\": 30, \\\"set\\\": 8, \\\"hashset\\\": 20, \\\"objects\\\": 4, \\\"random\\\": 6, \\\"pattern\\\": 1, \\\"regex\\\": 1, \\\"list\\\": 18, \\\"bufferedoutputstream\\\": 2, \\\"filenotfoundexception\\\": 14, \\\"filereader\\\": 5, \\\"linkedhashset\\\": 3, \\\"instanceof\\\": 17, \\\"function\\\": 6, \\\"bifunction\\\": 3, \\\"inttolongfunction\\\": 3, \\\"file\\\": 15, \\\"container\\\": 3, \\\"filewriter\\\": 3, \\\"awt\\\": 4, \\\"default\\\": 1, \\\"switch\\\": 1, \\\"err\\\": 7, \\\"collectors\\\": 10, \\\"standardcharsets\\\": 1, \\\"charset\\\": 1, \\\"nio\\\": 4, \\\"stream\\\": 10, \\\"arraydeque\\\": 2, \\\"setout\\\": 8, \\\"setin\\\": 6, \\\"protected\\\": 9, \\\"float\\\": 5, \\\"calendar\\\": 2, \\\"bitset\\\": 3, \\\"fileoutputstream\\\": 2, \\\"sortedset\\\": 3, \\\"currenttimemillis\\\": 9, \\\"gc\\\": 2, \\\"datainputstream\\\": 9, \\\"intstream\\\": 3, \\\"stringjoiner\\\": 3, \\\"flush\\\": 4, \\\"parseexception\\\": 1, \\\"simpledateformat\\\": 2, \\\"consumer\\\": 2, \\\"seterr\\\": 2, \\\"htmldocument\\\": 1, \\\"htmlreader\\\": 1, \\\"preaction\\\": 1, \\\"management\\\": 2, \\\"query\\\": 2, \\\"concurrent\\\": 5, \\\"threadlocalrandom\\\": 3, \\\"longstream\\\": 1, \\\"jarentry\\\": 1, \\\"jar\\\": 1, \\\"exit\\\": 1, \\\"bytearrayinputstream\\\": 1, \\\"printf\\\": 1, \\\"timeunit\\\": 2, \\\"hashtable\\\": 1, \\\"iterator\\\": 2, \\\"binaryoperator\\\": 1, \\\"arraycopy\\\": 1, \\\"mathcontext\\\": 2, \\\"docflavor\\\": 2, \\\"writer\\\": 1, \\\"paths\\\": 3, \\\"read\\\": 3, \\\"localdate\\\": 1, \\\"localdatetime\\\": 1, \\\"localtime\\\": 1, \\\"instant\\\": 1, \\\"time\\\": 1, \\\"linkedhashmap\\\": 2, \\\"point\\\": 1}\", \"index_docs\": \"{\\\"33\\\": 393, \\\"19\\\": 395, \\\"6\\\": 396, \\\"25\\\": 318, \\\"15\\\": 396, \\\"21\\\": 344, \\\"76\\\": 16, \\\"16\\\": 396, \\\"8\\\": 396, \\\"31\\\": 140, \\\"11\\\": 396, \\\"9\\\": 396, \\\"13\\\": 396, \\\"14\\\": 375, \\\"48\\\": 71, \\\"29\\\": 240, \\\"4\\\": 396, \\\"18\\\": 396, \\\"1\\\": 396, \\\"28\\\": 269, \\\"12\\\": 329, \\\"2\\\": 396, \\\"10\\\": 355, \\\"22\\\": 396, \\\"20\\\": 222, \\\"37\\\": 191, \\\"41\\\": 196, \\\"24\\\": 370, \\\"3\\\": 396, \\\"38\\\": 182, \\\"7\\\": 396, \\\"51\\\": 72, \\\"47\\\": 127, \\\"5\\\": 396, \\\"27\\\": 177, \\\"44\\\": 69, \\\"26\\\": 396, \\\"32\\\": 326, \\\"53\\\": 77, \\\"23\\\": 220, \\\"35\\\": 265, \\\"50\\\": 129, \\\"52\\\": 88, \\\"42\\\": 128, \\\"34\\\": 149, \\\"45\\\": 149, \\\"17\\\": 220, \\\"30\\\": 160, \\\"46\\\": 106, \\\"56\\\": 47, \\\"36\\\": 263, \\\"40\\\": 237, \\\"49\\\": 130, \\\"60\\\": 41, \\\"57\\\": 47, \\\"43\\\": 118, \\\"96\\\": 9, \\\"106\\\": 6, \\\"39\\\": 142, \\\"77\\\": 17, \\\"95\\\": 10, \\\"73\\\": 11, \\\"58\\\": 51, \\\"81\\\": 12, \\\"154\\\": 1, \\\"90\\\": 2, \\\"61\\\": 31, \\\"54\\\": 69, \\\"55\\\": 66, \\\"74\\\": 16, \\\"84\\\": 13, \\\"102\\\": 7, \\\"111\\\": 3, \\\"107\\\": 4, \\\"101\\\": 8, \\\"66\\\": 22, \\\"78\\\": 16, \\\"97\\\": 9, \\\"64\\\": 22, \\\"71\\\": 19, \\\"123\\\": 3, \\\"92\\\": 10, \\\"122\\\": 3, \\\"91\\\": 12, \\\"88\\\": 14, \\\"108\\\": 6, \\\"98\\\": 9, \\\"124\\\": 3, \\\"85\\\": 9, \\\"140\\\": 2, \\\"125\\\": 3, \\\"141\\\": 2, \\\"59\\\": 44, \\\"155\\\": 1, \\\"89\\\": 13, \\\"126\\\": 3, \\\"69\\\": 22, \\\"67\\\": 22, \\\"82\\\": 15, \\\"65\\\": 22, \\\"112\\\": 5, \\\"127\\\": 3, \\\"62\\\": 30, \\\"99\\\": 8, \\\"68\\\": 20, \\\"113\\\": 4, \\\"103\\\": 6, \\\"157\\\": 1, \\\"156\\\": 1, \\\"72\\\": 18, \\\"128\\\": 2, \\\"83\\\": 14, \\\"109\\\": 5, \\\"129\\\": 3, \\\"63\\\": 17, \\\"86\\\": 6, \\\"130\\\": 3, \\\"131\\\": 3, \\\"75\\\": 15, \\\"117\\\": 3, \\\"118\\\": 3, \\\"110\\\": 4, \\\"159\\\": 1, \\\"158\\\": 1, \\\"70\\\": 7, \\\"93\\\": 10, \\\"161\\\": 1, \\\"160\\\": 1, \\\"119\\\": 4, \\\"79\\\": 10, \\\"132\\\": 2, \\\"100\\\": 8, \\\"104\\\": 6, \\\"80\\\": 9, \\\"114\\\": 5, \\\"143\\\": 2, \\\"133\\\": 3, \\\"142\\\": 2, \\\"134\\\": 3, \\\"87\\\": 9, \\\"144\\\": 2, \\\"94\\\": 9, \\\"120\\\": 3, \\\"115\\\": 3, \\\"105\\\": 4, \\\"162\\\": 1, \\\"145\\\": 2, \\\"146\\\": 2, \\\"147\\\": 2, \\\"163\\\": 1, \\\"164\\\": 1, \\\"165\\\": 1, \\\"135\\\": 2, \\\"136\\\": 2, \\\"116\\\": 5, \\\"137\\\": 3, \\\"166\\\": 1, \\\"168\\\": 1, \\\"167\\\": 1, \\\"169\\\": 1, \\\"170\\\": 1, \\\"171\\\": 1, \\\"148\\\": 2, \\\"172\\\": 1, \\\"149\\\": 2, \\\"173\\\": 1, \\\"174\\\": 1, \\\"150\\\": 2, \\\"151\\\": 2, \\\"175\\\": 1, \\\"138\\\": 3, \\\"139\\\": 3, \\\"177\\\": 1, \\\"178\\\": 1, \\\"179\\\": 1, \\\"176\\\": 1, \\\"121\\\": 1, \\\"152\\\": 2, \\\"153\\\": 1}\", \"index_word\": \"{\\\"1\\\": \\\"punctuation\\\", \\\"2\\\": \\\"identifier\\\", \\\"3\\\": \\\"operator\\\", \\\"4\\\": \\\"keyword\\\", \\\"5\\\": \\\"data\\\", \\\"6\\\": \\\"type\\\", \\\"7\\\": \\\"number\\\", \\\"8\\\": \\\"int\\\", \\\"9\\\": \\\"new\\\", \\\"10\\\": \\\"return\\\", \\\"11\\\": \\\"static\\\", \\\"12\\\": \\\"long\\\", \\\"13\\\": \\\"for\\\", \\\"14\\\": \\\"if\\\", \\\"15\\\": \\\"public\\\", \\\"16\\\": \\\"system\\\", \\\"17\\\": \\\"import\\\", \\\"18\\\": \\\"call\\\", \\\"19\\\": \\\"void\\\", \\\"20\\\": \\\"boolean\\\", \\\"21\\\": \\\"string\\\", \\\"22\\\": \\\"class\\\", \\\"23\\\": \\\"java\\\", \\\"24\\\": \\\"while\\\", \\\"25\\\": \\\"else\\\", \\\"26\\\": \\\"out\\\", \\\"27\\\": \\\"this\\\", \\\"28\\\": \\\"throws\\\", \\\"29\\\": \\\"null\\\", \\\"30\\\": \\\"io\\\", \\\"31\\\": \\\"private\\\", \\\"32\\\": \\\"println\\\", \\\"33\\\": \\\"in\\\", \\\"34\\\": \\\"util\\\", \\\"35\\\": \\\"try\\\", \\\"36\\\": \\\"catch\\\", \\\"37\\\": \\\"true\\\", \\\"38\\\": \\\"false\\\", \\\"39\\\": \\\"char\\\", \\\"40\\\": \\\"double\\\", \\\"41\\\": \\\"string2\\\", \\\"42\\\": \\\"print\\\", \\\"43\\\": \\\"break\\\", \\\"44\\\": \\\"byte\\\", \\\"45\\\": \\\"ioexception\\\", \\\"46\\\": \\\"final\\\", \\\"47\\\": \\\"implements\\\", \\\"48\\\": \\\"continue\\\", \\\"49\\\": \\\"inputstreamreader\\\", \\\"50\\\": \\\"bufferedreader\\\", \\\"51\\\": \\\"throw\\\", \\\"52\\\": \\\"printwriter\\\", \\\"53\\\": \\\"stringtokenizer\\\", \\\"54\\\": \\\"arraylist\\\", \\\"55\\\": \\\"arrays\\\", \\\"56\\\": \\\"inputstream\\\", \\\"57\\\": \\\"math\\\", \\\"58\\\": \\\"scanner\\\", \\\"59\\\": \\\"collections\\\", \\\"60\\\": \\\"biginteger\\\", \\\"61\\\": \\\"outputstream\\\", \\\"62\\\": \\\"hashmap\\\", \\\"63\\\": \\\"instanceof\\\", \\\"64\\\": \\\"inputmismatchexception\\\", \\\"65\\\": \\\"priorityqueue\\\", \\\"66\\\": \\\"map\\\", \\\"67\\\": \\\"comparator\\\", \\\"68\\\": \\\"hashset\\\", \\\"69\\\": \\\"linkedlist\\\", \\\"70\\\": \\\"err\\\", \\\"71\\\": \\\"stack\\\", \\\"72\\\": \\\"list\\\", \\\"73\\\": \\\"do\\\", \\\"74\\\": \\\"outputstreamwriter\\\", \\\"75\\\": \\\"file\\\", \\\"76\\\": \\\"interface\\\", \\\"77\\\": \\\"text\\\", \\\"78\\\": \\\"treeset\\\", \\\"79\\\": \\\"stream\\\", \\\"80\\\": \\\"protected\\\", \\\"81\\\": \\\"fileinputstream\\\", \\\"82\\\": \\\"treemap\\\", \\\"83\\\": \\\"filenotfoundexception\\\", \\\"84\\\": \\\"bufferedwriter\\\", \\\"85\\\": \\\"getproperty\\\", \\\"86\\\": \\\"function\\\", \\\"87\\\": \\\"currenttimemillis\\\", \\\"88\\\": \\\"array\\\", \\\"89\\\": \\\"queue\\\", \\\"90\\\": \\\"case\\\", \\\"91\\\": \\\"lang\\\", \\\"92\\\": \\\"javax\\\", \\\"93\\\": \\\"collectors\\\", \\\"94\\\": \\\"datainputstream\\\", \\\"95\\\": \\\"decimalformat\\\", \\\"96\\\": \\\"bigdecimal\\\", \\\"97\\\": \\\"vector\\\", \\\"98\\\": \\\"reflect\\\", \\\"99\\\": \\\"set\\\", \\\"100\\\": \\\"setout\\\", \\\"101\\\": \\\"entry\\\", \\\"102\\\": \\\"printstream\\\", \\\"103\\\": \\\"random\\\", \\\"104\\\": \\\"setin\\\", \\\"105\\\": \\\"flush\\\", \\\"106\\\": \\\"roundingmode\\\", \\\"107\\\": \\\"extends\\\", \\\"108\\\": \\\"swing\\\", \\\"109\\\": \\\"filereader\\\", \\\"110\\\": \\\"awt\\\", \\\"111\\\": \\\"super\\\", \\\"112\\\": \\\"sql\\\", \\\"113\\\": \\\"objects\\\", \\\"114\\\": \\\"float\\\", \\\"115\\\": \\\"stringjoiner\\\", \\\"116\\\": \\\"concurrent\\\", \\\"117\\\": \\\"container\\\", \\\"118\\\": \\\"filewriter\\\", \\\"119\\\": \\\"nio\\\", \\\"120\\\": \\\"intstream\\\", \\\"121\\\": \\\"time\\\", \\\"122\\\": \\\"plaf\\\", \\\"123\\\": \\\"iconuiresource\\\", \\\"124\\\": \\\"collationelementiterator\\\", \\\"125\\\": \\\"html\\\", \\\"126\\\": \\\"collection\\\", \\\"127\\\": \\\"deque\\\", \\\"128\\\": \\\"bufferedoutputstream\\\", \\\"129\\\": \\\"linkedhashset\\\", \\\"130\\\": \\\"bifunction\\\", \\\"131\\\": \\\"inttolongfunction\\\", \\\"132\\\": \\\"arraydeque\\\", \\\"133\\\": \\\"bitset\\\", \\\"134\\\": \\\"sortedset\\\", \\\"135\\\": \\\"management\\\", \\\"136\\\": \\\"query\\\", \\\"137\\\": \\\"threadlocalrandom\\\", \\\"138\\\": \\\"paths\\\", \\\"139\\\": \\\"read\\\", \\\"140\\\": \\\"parser\\\", \\\"141\\\": \\\"entity\\\", \\\"142\\\": \\\"fileoutputstream\\\", \\\"143\\\": \\\"calendar\\\", \\\"144\\\": \\\"gc\\\", \\\"145\\\": \\\"simpledateformat\\\", \\\"146\\\": \\\"consumer\\\", \\\"147\\\": \\\"seterr\\\", \\\"148\\\": \\\"timeunit\\\", \\\"149\\\": \\\"iterator\\\", \\\"150\\\": \\\"mathcontext\\\", \\\"151\\\": \\\"docflavor\\\", \\\"152\\\": \\\"linkedhashmap\\\", \\\"153\\\": \\\"point\\\", \\\"154\\\": \\\"with\\\", \\\"155\\\": \\\"lineseparator\\\", \\\"156\\\": \\\"regex\\\", \\\"157\\\": \\\"pattern\\\", \\\"158\\\": \\\"switch\\\", \\\"159\\\": \\\"default\\\", \\\"160\\\": \\\"charset\\\", \\\"161\\\": \\\"standardcharsets\\\", \\\"162\\\": \\\"parseexception\\\", \\\"163\\\": \\\"htmldocument\\\", \\\"164\\\": \\\"htmlreader\\\", \\\"165\\\": \\\"preaction\\\", \\\"166\\\": \\\"longstream\\\", \\\"167\\\": \\\"jar\\\", \\\"168\\\": \\\"jarentry\\\", \\\"169\\\": \\\"exit\\\", \\\"170\\\": \\\"bytearrayinputstream\\\", \\\"171\\\": \\\"printf\\\", \\\"172\\\": \\\"hashtable\\\", \\\"173\\\": \\\"binaryoperator\\\", \\\"174\\\": \\\"arraycopy\\\", \\\"175\\\": \\\"writer\\\", \\\"176\\\": \\\"instant\\\", \\\"177\\\": \\\"localdate\\\", \\\"178\\\": \\\"localdatetime\\\", \\\"179\\\": \\\"localtime\\\"}\", \"word_index\": \"{\\\"punctuation\\\": 1, \\\"identifier\\\": 2, \\\"operator\\\": 3, \\\"keyword\\\": 4, \\\"data\\\": 5, \\\"type\\\": 6, \\\"number\\\": 7, \\\"int\\\": 8, \\\"new\\\": 9, \\\"return\\\": 10, \\\"static\\\": 11, \\\"long\\\": 12, \\\"for\\\": 13, \\\"if\\\": 14, \\\"public\\\": 15, \\\"system\\\": 16, \\\"import\\\": 17, \\\"call\\\": 18, \\\"void\\\": 19, \\\"boolean\\\": 20, \\\"string\\\": 21, \\\"class\\\": 22, \\\"java\\\": 23, \\\"while\\\": 24, \\\"else\\\": 25, \\\"out\\\": 26, \\\"this\\\": 27, \\\"throws\\\": 28, \\\"null\\\": 29, \\\"io\\\": 30, \\\"private\\\": 31, \\\"println\\\": 32, \\\"in\\\": 33, \\\"util\\\": 34, \\\"try\\\": 35, \\\"catch\\\": 36, \\\"true\\\": 37, \\\"false\\\": 38, \\\"char\\\": 39, \\\"double\\\": 40, \\\"string2\\\": 41, \\\"print\\\": 42, \\\"break\\\": 43, \\\"byte\\\": 44, \\\"ioexception\\\": 45, \\\"final\\\": 46, \\\"implements\\\": 47, \\\"continue\\\": 48, \\\"inputstreamreader\\\": 49, \\\"bufferedreader\\\": 50, \\\"throw\\\": 51, \\\"printwriter\\\": 52, \\\"stringtokenizer\\\": 53, \\\"arraylist\\\": 54, \\\"arrays\\\": 55, \\\"inputstream\\\": 56, \\\"math\\\": 57, \\\"scanner\\\": 58, \\\"collections\\\": 59, \\\"biginteger\\\": 60, \\\"outputstream\\\": 61, \\\"hashmap\\\": 62, \\\"instanceof\\\": 63, \\\"inputmismatchexception\\\": 64, \\\"priorityqueue\\\": 65, \\\"map\\\": 66, \\\"comparator\\\": 67, \\\"hashset\\\": 68, \\\"linkedlist\\\": 69, \\\"err\\\": 70, \\\"stack\\\": 71, \\\"list\\\": 72, \\\"do\\\": 73, \\\"outputstreamwriter\\\": 74, \\\"file\\\": 75, \\\"interface\\\": 76, \\\"text\\\": 77, \\\"treeset\\\": 78, \\\"stream\\\": 79, \\\"protected\\\": 80, \\\"fileinputstream\\\": 81, \\\"treemap\\\": 82, \\\"filenotfoundexception\\\": 83, \\\"bufferedwriter\\\": 84, \\\"getproperty\\\": 85, \\\"function\\\": 86, \\\"currenttimemillis\\\": 87, \\\"array\\\": 88, \\\"queue\\\": 89, \\\"case\\\": 90, \\\"lang\\\": 91, \\\"javax\\\": 92, \\\"collectors\\\": 93, \\\"datainputstream\\\": 94, \\\"decimalformat\\\": 95, \\\"bigdecimal\\\": 96, \\\"vector\\\": 97, \\\"reflect\\\": 98, \\\"set\\\": 99, \\\"setout\\\": 100, \\\"entry\\\": 101, \\\"printstream\\\": 102, \\\"random\\\": 103, \\\"setin\\\": 104, \\\"flush\\\": 105, \\\"roundingmode\\\": 106, \\\"extends\\\": 107, \\\"swing\\\": 108, \\\"filereader\\\": 109, \\\"awt\\\": 110, \\\"super\\\": 111, \\\"sql\\\": 112, \\\"objects\\\": 113, \\\"float\\\": 114, \\\"stringjoiner\\\": 115, \\\"concurrent\\\": 116, \\\"container\\\": 117, \\\"filewriter\\\": 118, \\\"nio\\\": 119, \\\"intstream\\\": 120, \\\"time\\\": 121, \\\"plaf\\\": 122, \\\"iconuiresource\\\": 123, \\\"collationelementiterator\\\": 124, \\\"html\\\": 125, \\\"collection\\\": 126, \\\"deque\\\": 127, \\\"bufferedoutputstream\\\": 128, \\\"linkedhashset\\\": 129, \\\"bifunction\\\": 130, \\\"inttolongfunction\\\": 131, \\\"arraydeque\\\": 132, \\\"bitset\\\": 133, \\\"sortedset\\\": 134, \\\"management\\\": 135, \\\"query\\\": 136, \\\"threadlocalrandom\\\": 137, \\\"paths\\\": 138, \\\"read\\\": 139, \\\"parser\\\": 140, \\\"entity\\\": 141, \\\"fileoutputstream\\\": 142, \\\"calendar\\\": 143, \\\"gc\\\": 144, \\\"simpledateformat\\\": 145, \\\"consumer\\\": 146, \\\"seterr\\\": 147, \\\"timeunit\\\": 148, \\\"iterator\\\": 149, \\\"mathcontext\\\": 150, \\\"docflavor\\\": 151, \\\"linkedhashmap\\\": 152, \\\"point\\\": 153, \\\"with\\\": 154, \\\"lineseparator\\\": 155, \\\"regex\\\": 156, \\\"pattern\\\": 157, \\\"switch\\\": 158, \\\"default\\\": 159, \\\"charset\\\": 160, \\\"standardcharsets\\\": 161, \\\"parseexception\\\": 162, \\\"htmldocument\\\": 163, \\\"htmlreader\\\": 164, \\\"preaction\\\": 165, \\\"longstream\\\": 166, \\\"jar\\\": 167, \\\"jarentry\\\": 168, \\\"exit\\\": 169, \\\"bytearrayinputstream\\\": 170, \\\"printf\\\": 171, \\\"hashtable\\\": 172, \\\"binaryoperator\\\": 173, \\\"arraycopy\\\": 174, \\\"writer\\\": 175, \\\"instant\\\": 176, \\\"localdate\\\": 177, \\\"localdatetime\\\": 178, \\\"localtime\\\": 179}\"}}"